13/data/attachments/5b8f117230a0c6ec.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ac3da3b2-33ae-4ab0-8771-192183e6ae77</nif:username>
            <nif:friendToBeAdded>Justin_morning_Friend_21127_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>